<style lang="less" scoped>
    @import "../../common/css/index";

    .container {
        .least-full-screen();
        .bgw();

        .agreement {
            padding: 20px 20px 100px;
            border-bottom: 1px solid @mainFontColor;

            .title {
                font-size: large;
                font-weight: bold;
                text-align: center;
                margin-bottom: 50px;
            }

            h1.small-title {
                font-weight: bold;
                .fz(28px);
                margin-top: 1em;
                margin-bottom: 1em;
            }

            p {
                .fz(28px);
                text-indent: 2em;
                line-height: 1.5em;

            }

            p.stress {
                font-weight: bold;

            }
        }

.agree-info-wrap{
    padding-top: 40px;
    padding-bottom: 40px;
    .fz(28px);
    .agree-info-item{
        .fj(space-between);
        padding:0 10% 0 30%;

        .value{
            flex: 1;
            text-align: center;
        }
    }
}

    }
</style>

<template>
    <div class="container">
        <header-top :show-back="true"></header-top>

        <article class="agreement">
            <h1 class="title">蓓莉服饰公司代理协议书</h1>
            <h1 class="small-title">
                鉴于：
            </h1>
            <p>
                2014年11月，李克强出席首届世界互联网大会时指出，互联网是大众创业、万众创新的新工具。2015年3月5日十二届全国人大三次会议上，
                李克强总理在政府工作报告中首次提出“互联网+”行动计划。李克强在政府工作报告中提出，“制定“互联网+”行动计划，推动移动互联网、
                云计算、大数据、物联网等与现代制造业结合，促进电子商务、工业互联网和互联网金融健康发展，引导互联网企业拓展国际市场。
                ”2015年7月4日，经李克强总理签批，国务院日前印发《关于积极推进“互联网+”行动的指导意见》（以下简称《指导意见》），
                这是推动互联网由消费领域向生产领域拓展，加速提升产业发展水平，增强各行业创新能力，构筑经济社会发展新优势和新动能的重要举措。</p>
            <p>
                杭州蓓莉服饰有限公司（以下简称“蓓莉服饰公司”或“本公司”）积极响应国务院号召，推动服装行业与互联网、大数据、物联网等结合，
                以尽最大的努力运用互联网平台、信息通信技术在服装销售领域创造一种微商新生态为公司的目标与宗旨。
            </p>
            <p>
                感谢您理解本公司的目标与宗旨，愿意加入并与本公司共同完成目标，现经双方平等、自愿、协商一致签署本协议，以供双方信守：
            </p>
            <p>
                本公司是合法取得服装以及配饰产品销售的平台公司，有权对外发展销售服装以及配饰的直接代理商（以下简称“直接代理”），
                并同意直接代理在本公司管理下自行拓展分销商（以下简称“分销商”或“您”），本公司向所有分销商提供服装以及配饰云仓储服务、
                一件代发物流服务，并接受直接代理的委托对直接代理与分销商之间代理销售、收取货款、违约违规行为处置、保证金监管等行为代为处置与管理。
                分销商须注册登录本公司云仓，依据蓓莉服饰公司制定的规则以密码进行分销商身份信息的确认，
                然后签署并依据本协议以最终取得分销商的全部权利承担分销商的全部义务。
            </p>
            <p class="stress">
                本协议已在事前获得拓展您的直接代理商的确认；蓓莉服饰公司系基于您的直接代理商的指令与委托，代表您的直接代理商对您进行管理；
                本协议在您和蓓莉服饰公司之间仅形成受托管理关系，而非代理合同关系；因此蓓莉服饰公司有义务在此特别提醒：请您务必认真阅读、
                充分理解本协议各条款，特别是其中所涉及的免除或限制蓓莉服饰公司责任的条款、排除或限制您权利的条款等。请您审慎阅读并选择接受或不
                接受本协议。除非接受本协议所有条款，否则您无权获得蓓莉服饰公司于本协议项下所提供的任何服务内容。
                您一经注册或享受蓓莉服饰公司全部或部分服务即视为对本协议全部条款已充分理解并完全接受，且无任何异议。
            </p>

            <h1 class="small-title">
                第一条 分销商的声明与承诺
            </h1>
            <p>
                （一）您确认，在您注册成为蓓莉服饰微商部门某特定直接代理的分销商之前，您已充分阅读、理解并接受本协议的全部内容，
                一旦您选择接受本协议，即表示您同意遵循本协议之所有约定与条款，您确认您和本公司之间形成受托管理关系，而非代理合同关系，
                您认可本协议、本公司规则对您形成真实、合法、有效的法律约束。如有违反而导致任何法律后果，您将自己独立承担相应的法律责任。
            </p>
            <p>
                （二）您同意，本公司有权随时对本协议、本公司规则的内容进行单方面的变更，并以公告的方式予以公布，无需另行单独通知您；
                若您在本协议、本公司规则的内容公告变更后继续使用本公司全部或部分服务的，即表示您已充分阅读、
                理解并接受变更后的本协议及其他相关内容，也将遵循变更后的协议内容使用本服务；若您不同意变更后的协议内容，您应立即停止使用本公司全部服务。
            </p>
            <p>
                （三）您声明，在您同意接受本协议及其他相关内容并注册成为分销商时，您是具有法律规定的完全民事权利能力和民事行为能力，
                能够独立承担民事责任的自然人、法人或其他组织；本协议内容不受您所属国家或地区的排斥。不具备前述条件的，您应立即终止注册或停止使用本公司全部服务。
            </p>

            <h1 class="small-title">
                第二条 蓓莉服饰公司微商分销规则及惩罚措施
            </h1>
            <p>
                为有效保障本公司对蓓莉服饰公司微商部门产品的品牌管理、维护蓓莉服饰公司微商部门产品市场价格体系，以及您作为分销商的合法权益，
                您理解并同意接受以下规则：
            </p>
            <p>
                （一）您通过某特定直接代理提供的拓展码在本公司官方网站注册的，即表示您默认该直接代理为您的直接代理商。因拓展码具有人身专属性，
                如因您自身的原因使用了错误的拓展码，并因此让本公司认定您的特定直接代理商的，由此造成的全部后果及相关法律责任由您自行承担。
                您确认，本公司系接受您的直接代理商的委托对直接代理与您之间代理销售、收取货款、违约违规行为处置、保证金监管等行为代为处置与管理。
            </p>
            <p>
                （二）您首次向您的直接代理商进货时超过一定金额的蓓莉服饰公司微商部门产品并付清全款方能享受公司建议直接代理商给予分销商的批发价格
                ，您成为分销商后方有权自行销售蓓莉服饰公司微商部门产品，但您应当遵循本公司《蓓莉服饰公司全国互联网销售代理政策》等相关制度
                ，且本公司有权随时对该等制度进行单方面的修改、变更，并以公告的方式予以公布，该公告一单公布即视为本条款的必要补充，
                与本条款具有同等法律效率。
            </p>
            <p>
                （三）本公司依据您的直接代理商的指令为您提供云仓储服务、一件代发物流服务
                （即您通过直接代理的拓展码在本公司官方网站注册的分销商账户发出的提货请求，均视为从您的直接代理商的专属系统内发出，
                而本公司仅系依据您的直接代理商的指令满足其提货要求，向您发货），在不违反公司规定的情况下，公司正常在下单后120小时内从仓库发货。
                如您批量提货的，须遵守本公司的提货规则，且本公司有权随时对《蓓莉服饰公司批量提货规则》进行单方面的变更，并以公告的方式予以公布，
                无需另行单独通知您，该等变更于公告发布同时生效。
            </p>
            <p>
                （四）本公司经营的服装以及配饰产品均系获得国内授权，本公司不希望、不建议、不同意分销商在中国大陆以外的地区进行销售；
                任何在中国大陆以外地区销售的行为均系您的个人行为，与本公司无关，本公司不承担任何义务与责任，由您自行承担所有义务与责任。
            </p>
            <p>
                （五）本公司希望您只进行本公司产品的分销，不进行任何非本公司产品的销售，故本公司不希望、不建议、
                不同意您进行除蓓莉服饰公司产品之外的任何产品的销售，除非您事先取得了本公司的书面同意。
            </p>
            <p>
                <b>（六）本公司严禁任何主体和个人以本公司的名义从事国家法律法规禁止的传销、违规直销等形式销售蓓莉服饰公司微商部门产品；
                    严禁任何主体和个人以本公司产品名义生产、制造、推广、销售假冒伪劣产品；严禁任何违法违规行为。</b>
                一旦本公司发现或独立判断分销商及/或其实际控制人、利害关系人（如亲、友等）存在上述行为，视为严重违反本协议之行为，
                本公司有权立即代表您的直接代理商取消您的分销商资格并没收您的保证金。
            </p>
            <p>
                （七）您因违规违约行为导致保证金被没收，但公司仍然同意您的直接代理商保留您的分销商资格的，
                您应及时按照因违规违约提高后的保证金的标准补交保证金，否则公司有权代表直接代理商暂停向您供货。
            </p>
            <p>
                （八）分销商必须严格遵守蓓莉服饰公司微商部门产品的品牌宣传推广的所有规定，包括但不限于：
            </p>
            <p>
                1、不得以任何名义任何形式，将本公司法人信息、注册信息、品牌信息、授权品牌信息等重要信息及含有该等重要信息的关键字、
                词作为认证信息在任何平台注册使用或供个人或他人使用。
            </p>
            <p>
                2、不得在以个人信息注册的任何平台中，使用“官方”“官网”等代表公司权威性词语作为注册名称或昵称等使用。
            </p>
            <p>
                3、不得违背广告法，不得使用违反广告法的字、词、句等。
            </p>
            <p>
                4、未经本公司书面同意，任何分销商均不得以“蓓莉服饰公司官方人员”、“蓓莉服饰公司员工”等身份在任何场合进行宣传和招商。
            </p>
            <p>
                5、为了维护“蓓莉服饰公司”品牌的合法性、严肃性， 您第一次出现违反本条内容的言行时，本公司有权对您扣除全部保证金并要求您整改；
                整改结束并重新缴纳保证金后，本公司恢复发货。
            </p>
            <p>
                您第二次出现违反本条内容的言行时，您同意公司有权代表您的直接代理商取消您的分销资格，没收您的保证金，并建议您的直接代理商对您进行处理。
            </p>
            <p>
                （九）分销商违规事项的细则说明：
            </p>
            <p>
                1.分销商发生违约违规行为，本公司有权先予以系统封号处理，再进行公布；一经本公司独立判断确定的，
                您同意本公司有权选择代表您的直接代理商取消您的分销资格，没收您的保证金，并建议您的直接代理商对您进行处理。
                如违规行为情节严重、扰乱正常市场秩序、导致第三方的不正当竞争及/或给公司造成损失的，本公司有权通过法律途径追索所有直接间接损失，
                您应当根据违约程度赔偿该等损失并承担公证费、诉讼费、律师费等费用。
            </p>
            <p>
                2.分销商发生违约违规行为，本公司未选择立即代表您的直接代理商取消您的分销资格的，则本公司有权扣除保证金、取消未出货订单、
                暂时中止供货，直至分销商终止违规行为，赔偿损失并完成整改。
            </p>

            <h1 class="small-title">
                第三条 分销商结算规则
            </h1>
            <p>
                为有效保障您销售蓓莉服饰公司微商部门产品时的合法权益，为有效保障自您处购买蓓莉服饰公司微商部门产品的最终消费者的合法权益，
                更好地监管销售蓓莉服饰公司微商部门的产品质量，您理解并同意接受以下结算规则：
            </p>
            <p class="stress">
                （一）公司为您与您的直接代理商的货款往来，开立专门银行账户（另行指定 ），您支付给您的直接代理商的货款须先行支付至该专门账户，
                该等款项将即时计入您的直接代理商的虚拟账户以便您的直接代理商及时收取您的货款，该账户内的货款不产生利息。
            </p>
            <p class="stress">
                （二）您分销的蓓莉服饰公司微商部门产品如发生质量问题，将由本公司负责解决。您支付货款的后一个工作日，
                您的直接代理商即有权通过其虚拟账户实时提现您支付其的全额货款。
            </p>
            <p class="stress">
                （三）就您的货款差价收入，您应当根据各自所在地的法律法规、市场规则申报、缴纳相应的税款及管理费用（如有）。
                您及您的直接代理商因结算发生争议时，可申请公司依据全国统一市场价格政策及结算规则进行协调。
            </p>
            <p class="stress">
                （四）如您未及时足额支付货款，未及时与您的直接代理商结算并收取款项，未及时足额缴纳相应的税、费（如有）及因您单方面原因导致的不利经济与法律后果，由您自行承担。
            </p>

            <h1 class="small-title">
                第四条 保证金约定
            </h1>
            <p>
                （一）分销期间，如您存在违规违约行为，本公司有权代表您的直接代理商直接没收您的保证金，并要求您按约规则补足。
            </p>
            <p>
                （二）您申请退出分销商时及/或您与本公司终止受托管理关系时，本公司将根据您的直接代理商的要求无息退还相应金额的保证金。
            </p>
            <p>
                （三）为有效实施监管，您的直接代理商已明确授权本公司有权代您其对您收取保证金并采取上述（一）（二）（三）措施，
                包括但不限于代收、没收、代扣、退还等。
            </p>

            <h1 class="small-title">
                第五条 隐私权保护
            </h1>
            <p>
                一旦您同意本协议、《管理协议》或使用本公司全部或部分服务，您即同意本公司按照以下条款来使用和披露您的个人信息。
            </p>
            <p>
                （一）用户名和密码
            </p>
            <p>
                在您注册成为蓓莉服饰公司分销商（用户）时，我们会要求您设置用户名和密码来识别您的身份，您仅可通过您设置的用户名和密码来使用该账户
                ，如果您泄漏了用户名及/或密码，您可能会丢失您的个人识别信息，并可能导致对您不利的法律后果。该账户和密码因任何原因受到潜在或现实危险时
                ，您应该立即和本公司取得联系，在您告知本公司且本公司采取行动前，您应当自行承担该账户项下的所有责任与义务，本公司对此不承担任何责任。
            </p>
            <p>
                （二）注册信息
            </p>
            <p>
                1、分销商在注册个人账户时应提交真实姓名、身份证号码、家庭地址、电话号码，并在公司及/或代表直接代理商认为必要时应授权本公司调取您的个人信用
                ，本公司将严格履行相关保密约定。<b>您有义务维持并更新个人的资料，确保其为真实、最新、有效及完整。若个人提供任何错误、虚假、
                过时或不完整的资料，或者蓓莉服饰公司依其独立判断怀疑资料为错误、虚假、过时或不完整，蓓莉服饰公司有权采取措施，
                包括但不限于停止该注册帐户的使用、拒绝提供平台的部分或全部功能等。在此情况下，蓓莉服饰公司不承担任何责任，
                并且您同意自行负担因此所产生的直接或间接的任何支出或损失。</b>
            </p>
            <p>
                2、对于您自己泄露自己账户信息及/或个人资料导致的任何责任与后果，均由您自行承担，本公司不予负责。
            </p>
            <p>
                3、您发生严重违约行为时，本公司及/或您的直接代理商有权在公司官网、微信公众号、所有分销商微信群等披露您的真实姓名、用户名、
                违约行为查明情况及处罚措施以作警示，您确认对此无异议。
            </p>
            <p>
                （三）银行账户信息
            </p>
            <p>
                本公司所提供的服务需要您提供您的银行账户信息，在您提供相应信息后，本公司将严格履行相关保密约定。
                您确认您系自愿提供您的银行账户信息，并对其真实、最新、有效及完整负责，本公司不承担任何因您未提供真实、最新、
                有效及完整的银行账户信息而导致的任何失误、损失等。
            </p>

            <h1 class="small-title">
                第六条 系统中断或故障的免责
            </h1>
            <p>
                本公司网络系统因下列状况无法正常运作，使您无法使用各项服务时，本公司不承担任何损害赔偿责任，该等状况包括但不限于：
            </p>
            <p>

            </p>
            <p>（一） 本公司在本网站公告之系统停机维护期间。</p>
            <p>（二） 电力、电信设备出现故障不能进行数据传输。</p>
            <p>（三） 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本公司系统障碍不能执行业务的。 </p>
            <p>（四） 由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。</p>

            <h1 class="small-title">
                第七条 送达地址确认
            </h1>
            <p>
                蓓莉服饰公司对于您的通知及任何其他的协议、法律文件的修改、变更、告示或其他关于分销商使用的账户及服务的通知，
                您确认蓓莉服饰公司可通过公司官网公告、分销商微信群发送、您注册时登记的电子邮件、手机短信、无线通讯装置等电子方式进行，
                您应当随时注意上述电子方式以及时知晓该等通知。该等通知的电子方式发送之日视为已送达收件人并直接生效
                （如以微信群方式发送公司相关公告、通知的；有落款日期的，落款日期即为送达日期生效日期；无落款日期的，
                本公司发送之时即为送达时间生效时间），而不论您是否确实收到。
            </p>

            <h1 class="small-title">
                第八条 分销商资格终止
            </h1>
            <p>
                （一）分销期间，按照您与您的直接代理商及/或您与蓓莉服饰公司约定的分销终止情况出现的，本协议自然终止。　
            </p>
            <p>
                （二）分销期间，您存在违规行为且本公司有权代表您的直接代理商终止并通知终止的，本协议终止。
            </p>
            <p>
                （三）分销商期间，因不可抗力原因导致本协议无法继续履行的，本协议自然终止。
            </p>
            <p>
                （四）分销商期间，各方协商一致或出现其他需要终止分销商关系的情形的，本协议终止。
            </p>
            <p>
                （五）本协议终止后，本公司将根据您的直接代理商的要求及蓓莉服饰公司代理商退出规则进行处理。
            </p>

            <h1 class="small-title">
                第九条 协议效力
            </h1>
            <p>
                本协议为电子协议，一经登陆本公司官网（官方网络平台）进行注册并选择“同意”的，本协议即生效。您注册并选择“同意”后，
                不得以不知晓或不理解本协议内容、法律含义为由，拒绝履行本协议所有内容。本协议与本公司官网（官方网络平台）
                公布的其他相关规定以及关于分销商的其他法律文件共同形成约束您与本公司、您与您的直接代理商等的完整的法律文件，具有同等效力。
            </p>

            <h1 class="small-title">
                第十条 法律适用及管辖
            </h1>
            <p>
                本协议适用中华人民共和国相关法律法规，履行期间的任何争议在无法友好协商时均提交本公司注册地人民法院管辖。
            </p>

            <h1 class="small-title">
                第十一条 其他
            </h1>
            <p>
                本协议最终解释权归杭州蓓莉服饰有限公司所有。
            </p>

        </article>

        <section class="agree-info-wrap">
            <p class="agree-info-item">
                <span class="label">代理姓名：</span>
                <span class="value">{{userInfo.USname}}</span>
            </p>
            <p class="agree-info-item">
                <span class="label">签约时间：</span>
                <span class="value">{{userInfo.UScreatetime}}</span>
            </p>
        </section>


    </div>
</template>

<script>
    import {mapState} from "vuex";

    export default {
        name: "protocol",

        data() {
            return {}
        },

        components: {},

        computed: {
            ...mapState(['userInfo'])
        },

        methods: {},

        created() {
        },
    }
</script>

